#ifndef RECOVERY_CONFIG_H
#define RECOVERY_CONFIG_H
/*!
 *\file		recovery_config.h
 *\brief	the file to define recovery parameter
 *
 *\author	GuoHongwei
 *\version	v1.0
 *\date		12Dec14
 *
 *\history	\arg 1.0, GuoHongwei, 12Dec14, create the file.
 */
/***************************************************************************/
/*                    CONFIGURATIONS                    */
/***************************************************************************/

/***************************************************************************/
/*                    INCLUDE FILES                     */
/***************************************************************************/

/***************************************************************************/
/*                    DEFINES                           */
/***************************************************************************/
//LED灯高电位点亮
#define LED_ON				0x10
#define LED_OFF				0x00

//reset按键低电平为按下
#define RESET_PUSH_DOWN		0

//各按键、LED引脚号
#ifndef REC_GPIO_RESET
#define REC_GPIO_RESET		64
#endif
//不使用该灯则定义为-1
#ifndef REC_GPIO_LAN
#define REC_GPIO_LAN		6
#endif
#ifndef REC_GPIO_USB_1
#define REC_GPIO_USB_1		7
#endif
#ifndef REC_GPIO_USB_3
#define REC_GPIO_USB_3		8
#endif
#ifndef REC_GPIO_WPS
#define REC_GPIO_WPS		9
#endif
#ifndef REC_GPIO_STATUS
#define REC_GPIO_STATUS		53
#endif

//bin在内存中的存放位置，非flash
#define TFTP_DOWNLOAD_ADDR		"0x42000000"
#define RECOVERY_ADDR			0x42000000

//本地IP和对应的用户TFTPserver IP
#define IP_ADDR					"192.168.0.1"
#define SERVER_IP				"192.168.0.66"

//连接TFTPserver的最长等待时间,秒
#define MAX_WAITTIME			15
//恢复镜像的名字
//#define RECOVERY_IMAGE			"ac2500.bin"
#define RECOVERY_IMAGE			"ArcherC2600_1.0_tp_recovery.bin"
/***************************************************************************/
/*                    TYPES                             */
/***************************************************************************/

/***************************************************************************/
/*                    EXTERN_PROTOTYPES                 */
/***************************************************************************/

/***************************************************************************/
/*                    LOCAL_PROTOTYPES                  */
/***************************************************************************/

/***************************************************************************/
/*                    VARIABLES                         */
/***************************************************************************/

/***************************************************************************/
/*                    LOCAL_FUNCTIONS                   */
/***************************************************************************/

/***************************************************************************/
/*                    PUBLIC_FUNCTIONS                  */
/***************************************************************************/

/***************************************************************************/
/*                    GLOBAL_FUNCTIONS                  */
/***************************************************************************/
#endif